# ServiceId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..ServiceId Property
FabricationService Class See Also
---
The service identifier of the service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int ServiceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServiceId As Integer
	Get
```

Visual C++
---
```text
public:
property int ServiceId {
	int get ();
}
```

# See Also
FabricationService Class
Autodesk.Revit.DB Namespace